IDENTIFICATION DIVISION.
PROGRAM-ID. INTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BALANCE      PIC 9(7)V99.
01 RATE         PIC 9V999 VALUE 0.050.
01 INTEREST     PIC 9(6)V99.

PROCEDURE DIVISION.
MAIN.
    DISPLAY "ENTER BALANCE:"
    ACCEPT BALANCE

    COMPUTE INTEREST = BALANCE * RATE

    DISPLAY "INTEREST = " INTEREST
    STOP RUN.