IDENTIFICATION DIVISION.
PROGRAM-ID. LIBRARY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BOOK-ID      PIC X(10).
01 AVAILABLE    PIC X VALUE "Y".

PROCEDURE DIVISION.
MAIN.
    DISPLAY "ENTER BOOK ID:"
    ACCEPT BOOK-ID

    IF AVAILABLE = "Y"
        MOVE "N" TO AVAILABLE
        DISPLAY "BOOK BORROWED"
    ELSE
        DISPLAY "BOOK NOT AVAILABLE"
    END-IF

    STOP RUN.