IDENTIFICATION DIVISION.
PROGRAM-ID. LOAN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 SALARY        PIC 9(6).
01 CREDIT-SCORE  PIC 999.
01 APPROVED      PIC X VALUE "N".

PROCEDURE DIVISION.
MAIN.
    DISPLAY "SALARY:"
    ACCEPT SALARY

    DISPLAY "CREDIT SCORE:"
    ACCEPT CREDIT-SCORE

    IF SALARY >= 5000
        IF CREDIT-SCORE >= 700
            MOVE "Y" TO APPROVED
        END-IF
    END-IF

    IF APPROVED = "Y"
        DISPLAY "LOAN APPROVED"
    ELSE
        DISPLAY "LOAN REJECTED"
    END-IF

    STOP RUN.