IDENTIFICATION DIVISION.
PROGRAM-ID. PAYROLL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 EMP-NAME      PIC X(20).
01 HOURS-WORKED PIC 9(3).
01 HOURLY-RATE  PIC 9(3)V99.
01 GROSS-PAY    PIC 9(5)V99.

PROCEDURE DIVISION.
MAIN.
    DISPLAY "ENTER EMPLOYEE NAME:"
    ACCEPT EMP-NAME

    DISPLAY "ENTER HOURS:"
    ACCEPT HOURS-WORKED

    DISPLAY "ENTER RATE:"
    ACCEPT HOURLY-RATE

    COMPUTE GROSS-PAY =
        HOURS-WORKED * HOURLY-RATE

    DISPLAY "EMPLOYEE: " EMP-NAME
    DISPLAY "GROSS PAY: " GROSS-PAY

    STOP RUN.